app/desktop/modules.dot
digraph {
edge ["dir"="forward"]
graph ["dpi"="100","label"=":app:desktop","labelloc"="t","fontsize"="30","ranksep"="1.5","rankdir"="TB"]
node ["style"="filled"]
":account:model" ["fillcolor"="#9D8DF1","shape"="none"]
":api:builder" ["fillcolor"="#9D8DF1","shape"="none"]
":api:github" ["fillcolor"="#9D8DF1","shape"="none"]
":app:desktop" ["fillcolor"="#FF5555","color"="black","penwidth"="3","shape"="box"]
":app:di" ["fillcolor"="#FCB103","shape"="none"]
":budget:model" ["fillcolor"="#9D8DF1","shape"="none"]
":codegen:annotation" ["fillcolor"="#9D8DF1","shape"="none"]
":core:di" ["fillcolor"="#FCB103","shape"="none"]
":core:model" ["fillcolor"="#9D8DF1","shape"="none"]
":logging" ["fillcolor"="#9D8DF1","shape"="none"]
":prefs" ["fillcolor"="#9D8DF1","shape"="none"]
{
edge ["dir"="none"]
graph ["rank"="same"]
":app:desktop"
}
":api:builder" -> ":core:model"
":api:builder" -> ":logging" ["style"="dotted"]
":api:github" -> ":codegen:annotation" ["style"="dotted"]
":api:github" -> ":core:model"
":app:desktop" -> ":app:di" ["style"="dotted"]
":app:di" -> ":api:builder" ["style"="dotted"]
":app:di" -> ":api:github"
":app:di" -> ":budget:model"
":app:di" -> ":core:di"
":app:di" -> ":core:model"
":app:di" -> ":prefs"
":prefs" -> ":account:model"
":prefs" -> ":core:model"
}
